Функция ЕстьОтрицательныеОстатки(ЭтотДокументСсылка, Дата) Экспорт 
	Результат     = Ложь;
	ГраницаОтбора = Новый Граница(Дата, ВидГраницы.Включая);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиОстатки.Номенклатура КАК Номенклатура,
		|	-ОстаткиОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.Остатки.Остатки(
		|			&ДатаОтбора,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					РеализацияТоваровСостав.Номенклатура КАК Номенклатура
		|				ИЗ
		|					Документ.РеализацияТоваров.Состав КАК РеализацияТоваровСостав
		|				ГДЕ
		|					РеализацияТоваровСостав.Ссылка = &ЭтотДокумент)) КАК ОстаткиОстатки
		|ГДЕ
		|	ОстаткиОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОтбора", ГраницаОтбора);
	Запрос.УстановитьПараметр("ЭтотДокумент", ЭтотДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Текст = СтрШаблон("Не хватает товара ""%1"" в количестве %2шт.", ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Количество);	
			Сообщить(Текст);
			
			Результат = Истина;
			
		КонецЦикла
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ПоказатьОстаток(Номенклатура, Дата) Экспорт
	ГраницаОтбора = Новый Граница(Дата, ВидГраницы.Включая);
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиОстатки.КоличествоОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.Остатки.Остатки(&ДатаОтбора, Номенклатура = &Номенклатура) КАК ОстаткиОстатки";
	
	Запрос.УстановитьПараметр("ДатаОтбора", ГраницаОтбора);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Результат = РезультатЗапроса[0].Остаток;	
	
 Возврат Результат;
КонецФункции 

















